*Exercise 2.25:* Give combinations of `car's and `cdr's that will
pick 7 from each of the following lists:

    (1 3 (5 7) 9)

    ((7))

    (1 (2 (3 (4 (5 (6 7))))))

#+begin_src scheme :results list
  (list
   (cadr (caddr (list 1 3 (list 5 7) 9)))
   (caar (list (list 7)))
   (cadr
    (cadr
     (cadr
      (cadr
       (cadr
        (cadr (list 1 (list 2 (list 3 (list 4 (list 5 (list 6 7)))))))))))))
#+end_src

#+RESULTS:
- 7
- 7
- 7
